# StructuralTopReleaseFy Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralTopReleaseFy Property
ParameterTypeId Class See Also
---
"Top Fy"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralTopReleaseFy { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralTopReleaseFy As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralTopReleaseFy {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace